DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
// Stm32xxxx_hal_uart_ext.c, расширение драйвера Stm32xxxx_hal_uart
// (дописать суть расширений)
#include "PlatformConfig.h"					// семейство микроконтроллеров
#include "stm32xxxx_hal.h"					// дрова периферии, в т.ч. 
#include "Stm32xxxx_hal_uart_ext.h"			// родной

// Прототипы внутренних функций драйвера
static void UART_Ext_DMATransmitCplt( DMA_HandleTypeDef *hdma );				// [замена]	DMA UART transmit process complete callback
static void UART_Ext_DMAError( DMA_HandleTypeDef *hdma );   						// [замена]	DMA UART communication error callback
static void UART_Ext_Transmit_Complete_IT( UART_HandleTypeDef *huart );		// [замена]	UART transmit process complete callback
static void UART_Ext_Transmit_Empty8_IT( UART_HandleTypeDef *huart );			// [замена]	UART_TxISR_8BIT
static void UART_Ext_Receive_Idle_IT( UART_HandleTypeDef *huart );				// [новая]	UART receive idle callback
static void UART_Ext_RxDMABuffer_Update( UART_Ext_HandleTypeDef *huart_ext );	// Переместить голову приемного буфера по состоянию канала DMA
static void UART_Ext_DMAReceiveCyclicCplt( DMA_HandleTypeDef *hdma );			// Обработчик UART.Rx.DMA.Complete и UART.Rx.DMA.HalfComplete - перемещает голову очереди вперед. Может понадобиться при приеме больших непрерывных пакетов
static void UART_Ext_DMAReceiveCplt( DMA_HandleTypeDef *hdma );					// Обработчик UART.Rx.DMA.Complete - выставляет флаг завершения према запрошенного буфера
static void UART_Ext_EndTxTransfer(UART_HandleTypeDef *huart);
static void UART_Ext_EndRxTransfer(UART_HandleTypeDef *huart);


// Проверка, что хендлер huart является расширенной версией стандартного хендлера
BaseType_t HAL_UART_Ext_ValidateHdl( UART_Ext_HandleTypeDef *huart )
{
//	return ( ( NULL != huart ) && ( huart->Instance == huart->Common.Instance ) );
	bool Result = false;
	do
	{
		if( NULL == huart )
			break;
		if( !IS_UART_INSTANCE( huart->Instance ) )
			break;
		if( huart->Instance != huart->Common.Instance )
			break;
		Result = true;
	} while( 0 );
	return Result;
}

// Инициализация расширенного хендлера UART
HAL_StatusTypeDef HAL_UART_Ext_Init( UART_Ext_HandleTypeDef *huart_ext )
{
	// !!!По-хорошему, сначала надо проверять - поддерживается ли режим, указанный в huart->Init, расширенным драйвером.
	UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;
	huart_ext->Instance = huart->Instance;		// заранее выполнить привязку для корректной работы HAL_UART_MspInit()
	huart_ext->TXEN_GPIO = NULL;				// обнулить. в соответствии с конфигурацией проекта, может быть инициализировано в проектно-зависимом HAL_UART_MspInit()
	huart->hdmatx = NULL;													\
	huart->hdmarx = NULL;													\

	HAL_StatusTypeDef ReturnValue;
	ReturnValue = HAL_UART_Init( huart );		// произвести стандартную иницализацию
	if( HAL_OK == ReturnValue )
	{	// Прошла стандартная инициализация. Провести расширенную инициализацию
		// Инициализация ножки RS485.TxEn УЖЕ должна быть произведена в HAL_UART_MspInit()
#ifdef	USE_FREERTOS
		assert_param( NULL != ( huart_ext->EventGroup = xEventGroupCreate( ) ) );		// Инициализировать хендлер событий
		( void ) xEventGroupSetBits( huart_ext->EventGroup, EVENT_UART_EXT_INIT_COMPLETE | EVENT_UART_EXT_ACCESS_READY );
#endif	// USE_FREERTOS
		huart_ext->EventBitsMask = EVENT_UART_EXT_INIT_COMPLETE;
		huart_ext->pByteQueueRx = NULL;
		huart_ext->TxCompleteCallback = NULL;
		huart_ext->IRQ_Handlers = ( UART_Ext_IRQ_Handlers_t ) { 0 };
		// Если при иницализации возникли ошибки, то можно ассертить, либо обнулять huart->Common.Instance и huart->Common.State

	}

	return ReturnValue;
}

// Деинициализация расширенного хедлера UART (не используется, может быть кривая)
HAL_StatusTypeDef HAL_UART_Ext_DeInit( UART_Ext_HandleTypeDef *huart )
{
	HAL_StatusTypeDef ReturnValue;
	ReturnValue = HAL_UART_DeInit( &huart->Common );
#ifdef	USE_FREERTOS
	vEventGroupDelete( huart->EventGroup );
#endif	// USE_FREERTOS
	return ReturnValue;
}


// При работе с модемом SIG60 есть рЯд проблем, в т.ч. при сбое модема
// (напр., от помех, статики) модем сбрасываетсЯ, и начинает слать эхо в ответ на передачу.
// Эхо воспринимаетсЯ постоЯнно включенным приемником, что создает проблемы.
// Одно из решений - принудительное отключение приема на времЯ передачи пакета через модем.
// После завершениЯ передачи пакета (штатно или сбойно) необходимо обратно включить передатчик.
// Кроме того, при запуске приема желательно проверЯть, что приемник включен.
// !!! Сохранение режима работы происходит через huart_ext->EventBitsMask, работать черерез критическую секцию!
static void HAL_UART_Ext_RxForModemDisable( UART_Ext_HandleTypeDef *huart_ext )
{	// Если в режиме модема включен приемник - выключить его, но запомнить, что был включен.
	if( huart_ext->EventBitsMask & EVENT_UART_EXT_MODEM_INIT_COMPLETE )
	{
		if( huart_ext->Instance->CR1 & USART_CR1_RE )
		{
			huart_ext->EventBitsMask |= EVENT_UART_EXT_RX_ENABLED;
			huart_ext->Instance->CR1 &= ~USART_CR1_RE;
		}
		else
			huart_ext->EventBitsMask &= ~EVENT_UART_EXT_RX_ENABLED;
	}
}

static void HAL_UART_Ext_RxForModemRestore( UART_Ext_HandleTypeDef *huart_ext )
{	// Если в режиме модема ранее был разрешен прием - включить приемник
	if( huart_ext->EventBitsMask & EVENT_UART_EXT_MODEM_INIT_COMPLETE )
	{
		if( huart_ext->EventBitsMask & EVENT_UART_EXT_RX_ENABLED )
			huart_ext->Instance->CR1 |= USART_CR1_RE;
		huart_ext->EventBitsMask &= ~EVENT_UART_EXT_RX_ENABLED;
	}
}

// Альтернатива HAL_UART_Transmit()
// Передать буфер из ОЗУ в UART через DMA.
// Разрешаются два прерывания - UART.Tx.DMA.TxC и UART.TxC.
// В каждом обработчике прерывания генерируются соответствующие события.
// Кроме того, в обработчике UART.TxC завершается передача через внешний драйвер RS-485 (если используется).
HAL_StatusTypeDef HAL_UART_Ext_Transmit( UART_Ext_HandleTypeDef *huart_ext, uint8_t *pData, uint16_t Size, EventBits_t EventBitsMask )
{
  uint32_t *tmp;
  UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;
  assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
  
  if(huart->gState == HAL_UART_STATE_READY) 
  {
    if((pData == NULL ) || (Size == 0)) 
    {
      return HAL_ERROR;
    }
	// Проверка, что передатчик UART включен.
	// ПредполагаетсЯ, что передатчик включаетсЯ при инициализации, а не при запуске передачи
    if( 0 == ( huart_ext->Instance->CR1 & USART_CR1_TE ) )
    {
      return HAL_ERROR;
    }
    
    /* Process Locked */
    __HAL_LOCK(huart);
    
