DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
    huart->pTxBuffPtr = pData;
    huart->TxXferSize = Size;
    huart->TxXferCount = Size;
    
    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->gState = HAL_UART_STATE_BUSY_TX;
    
    // Запретить прерывание USART.TxC на случай, если придет прерывание по завершению передачи предыдущего буфера
    __HAL_UART_DISABLE_IT( huart, UART_IT_TC );

	
	if( NULL != huart->hdmatx )
	{	// Подготовить передачу пакета через DMA, если допускаетсЯ его использовать
		/* Set the UART DMA transfer complete callback */
		huart->hdmatx->XferCpltCallback = UART_Ext_DMATransmitCplt;
		
		/* Set the UART DMA Half transfer complete callback */
		huart->hdmatx->XferHalfCpltCallback = NULL;
		// Не смотря на то, что обработчик DMA_IT_HT не инициализирован, прерывание все равно будет вызвано, т.к. оно всегда разрешается в HAL_DMA_Start_IT().
		// Чтобы заблокировать DMA_IT_HT и не лезть в HAL_DMA_Start_IT(), блокирование происходит сразу после HAL_DMA_Start_IT().
		
		/* Set the DMA error callback */
		huart->hdmatx->XferErrorCallback = UART_Ext_DMAError;

	    /* Enable the UART transmit DMA Stream */
    	tmp = (uint32_t*)&pData;
#if		defined( STM32F4 )
		__HAL_UART_CLEAR_FLAG( huart, UART_FLAG_TC );
#elif	defined( STM32L4 ) || defined( STM32F3 )
		__HAL_UART_CLEAR_FLAG( huart, UART_CLEAR_TCF );
#else
#error "Select Target Family!"
#endif
		assert_param( HAL_OK == HAL_DMA_Start_IT(huart->hdmatx, *(uint32_t*)tmp, ( uint32_t ) &UART_INSTANCE_TDR( huart->Instance ), Size ) );
		// Запретить обработку прерываний, разрешаемых в HAL_DMA_Start_IT() - чтобы не модифицировать HAL
		__HAL_DMA_DISABLE_IT( huart->hdmatx, DMA_IT_HT );  // Half Transmit	- не используетсЯ
#if		defined( STM32F4 )
		__HAL_DMA_DISABLE_IT( huart->hdmatx, DMA_IT_FE );  // FIFO Error	- не используетсЯ, при этом был рЯд прецендентов (МПИ, м.б. ГГП), когда срабатывал FIFO Error, но пакет нормально передавалсЯ.
#endif
	}

#ifdef	USE_FREERTOS
	// Сбросить накопившиеся события при передаче
	if( 0 != ( EventBitsMask & EVENT_UART_EXT_ALL ) )
		( void ) xEventGroupClearBits( huart_ext->EventGroup, EVENT_UART_EXT_TX_ALL );
#endif	// USE_FREERTOS

	// Разрешить передачу RS-485 (если инициализировано)
	if( huart_ext->TXEN_GPIO != NULL )
	{
		HAL_GPIO_WritePin( huart_ext->TXEN_GPIO, huart_ext->TXEN_Pin, GPIO_PIN_SET );
	}

	// Запомнить маску событий по передаче, которые надо будет сформировать
	ENTER_CRITICAL_SECTION( );		// !! работать с huart_ext->EventBitsMask через крит.секцию, т.к. это поле модифицируетсЯ в прерываниЯх!!
	WRITE_BIT_MASKED( huart_ext->EventBitsMask, EventBitsMask, EVENT_UART_EXT_TX_ALL );
	HAL_UART_Ext_RxForModemDisable( huart_ext );
	EXIT_CRITICAL_SECTION( );

	if( NULL != huart->hdmatx )
	{	// Запустить передачу пакета через DMA, если допускаетсЯ его использовать
		ENTER_CRITICAL_SECTION( );
	    // Enable the DMA transfer for transmit request by setting the DMAT bit in the UART CR3 register
    	huart->Instance->CR3 |= USART_CR3_DMAT;
	    // Разрешить прерывание USART.TxC
    	// !!! К этому моменту нужно быть уверенным, что первый байт из буфера уже попал в USART Data register,
		// и не может возникнуть прерывания USART.TxC при завершении передачи последнего байта из предыдущего буфера.
		huart_ext->IRQ_Handlers.xTxComplete = UART_Ext_Transmit_Complete_IT;
#if		defined( STM32F4 )
		__HAL_UART_CLEAR_FLAG( huart, UART_FLAG_TC );
		__HAL_UART_CLEAR_FLAG( huart, UART_FLAG_TC );
#elif	defined( STM32L4 ) || defined( STM32F3 )
		__HAL_UART_CLEAR_FLAG( huart, UART_CLEAR_TCF );
		__HAL_UART_CLEAR_FLAG( huart, UART_CLEAR_TCF );
#else
#error "Select Target Family!"
#endif
		__HAL_UART_ENABLE_IT( huart, UART_IT_TC );
		// Также здесь не должно возникать задержек (прерываний), обеспечивающих полное завершение передачи нового буфера прежде, чем будет сброшен флаг USART.TxC
		EXIT_CRITICAL_SECTION( );
	}
	else
	{	// Произвести передачу пакета без DMA, если не допускаетсЯ его использовать
#ifdef	USART_CR1_FIFOEN
#error	"Дописать!"
#endif
		// Set the Tx ISR function pointer according to the data word length
		if ((huart->Init.WordLength == UART_WORDLENGTH_9B) && (huart->Init.Parity == UART_PARITY_NONE))
			assert_param( 0 );
		huart_ext->IRQ_Handlers.xTxEmpty = UART_Ext_Transmit_Empty8_IT;
		__HAL_UART_ENABLE_IT( huart, UART_IT_TXE );
	}
    
    /* Process Unlocked */
    __HAL_UNLOCK(huart);
    
    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;   
  }
}

#include "ProjectConfig.h"
#include "common_gpio.h"
// Принимать из UART по DMA в буфер pByteQueueRx циклически.
// Формировать события при UART.RxIdle и UART.RxError.
// Данные записываются в циклический буфер pByteQueueRx по DMA, но голова pByteQueueRx передвигается в обработчиках UART.Rx.Idle, UART.Rx.DMA.Complete и UART.Rx.DMA.Complete.
// Вычитывать полученные данные необходимо отдельно, обращаясь к pByteQueueRx.
// !! Контроль переполнения можно сделать в обработчике UART.Rx.Idle, но это не будет работать при приеме непрерывного потока.
// !! При особой необходимости, для контроля переполнения можно использовать UART.Rx.DMA.Complete и UART.Rx.DMA.Complete.
// !! Сейчас контроль переполнения вообще не производится, слишком большие принимаемые пакеты могут быть потеряны!! (сейчас задача это допускает)
HAL_StatusTypeDef HAL_UART_Ext_ReceiveCyclicStart( UART_Ext_HandleTypeDef *huart_ext, ByteQueue_t *pByteQueueRx, EventBits_t EventBitsMask )
{
  uint32_t *tmp;
  UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;
  assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
  assert_param( NULL != pByteQueueRx );
  huart_ext->pByteQueueRx = pByteQueueRx;

  
  /* Check that a Rx process is not already ongoing */
  if(huart->RxState == HAL_UART_STATE_READY) 
  {
    if( !ByteQueue_Validate( huart_ext->pByteQueueRx ) )
    {
      return HAL_ERROR;
    }
	// Проверка, что приемник UART включен.
	// ПредполагаетсЯ, что приемник включаетсЯ при инициализации, а не при запуске приема
    if( 0 == ( huart_ext->Instance->CR1 & USART_CR1_RE ) )
    {
      return HAL_ERROR;
    }
    
    /* Process Locked */
    __HAL_LOCK(huart);
    
