DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
	ByteQueue_Clear( huart_ext->pByteQueueRx );
    huart->pRxBuffPtr = huart_ext->pByteQueueRx->pBuffer;
    huart->RxXferSize = huart_ext->pByteQueueRx->Size;
    
    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->RxState = HAL_UART_STATE_BUSY_RX;

	huart_ext->IRQ_Handlers.xRxIdle = UART_Ext_Receive_Idle_IT;
	
	// Переинициализировать DMA в кольцевой режим
	huart->hdmarx->Init.Mode = DMA_CIRCULAR;
	assert_param( HAL_OK == HAL_DMA_Init( huart->hdmarx ) );

    /* Set the UART DMA transfer complete callback */
//    huart->hdmarx->XferCpltCallback = UART_DMAReceiveCplt;
    huart->hdmarx->XferCpltCallback = UART_Ext_DMAReceiveCyclicCplt;		// Обновить счетчик принятых байт
    
    /* Set the UART DMA Half transfer complete callback */
//    huart->hdmarx->XferHalfCpltCallback = UART_DMARxHalfCplt;
	huart->hdmarx->XferHalfCpltCallback = UART_Ext_DMAReceiveCyclicCplt;	// Обновить счетчик принятых байт
    
    /* Set the DMA error callback */
    huart->hdmarx->XferErrorCallback = UART_Ext_DMAError;

    /* Enable the DMA Stream */
    tmp = (uint32_t*)&huart_ext->pByteQueueRx->pBuffer;
    assert_param( HAL_OK == HAL_DMA_Start_IT(huart->hdmarx, ( uint32_t ) &UART_INSTANCE_RDR( huart->Instance ), *(uint32_t*)tmp, huart_ext->pByteQueueRx->Size) );

	// Инициализировать счетчик принятых байт
    huart->RxXferCount = 0;
    
#ifdef	USE_FREERTOS
	// Сбросить накопившиеся события
	xEventGroupClearBits( huart_ext->EventGroup, EVENT_UART_EXT_RX_ALL );
#endif	// USE_FREERTOS

	// Запомнить маску событий по приему, которые надо будет сформировать
	ENTER_CRITICAL_SECTION( );
	WRITE_BIT_MASKED( huart_ext->EventBitsMask, EventBitsMask, EVENT_UART_EXT_RX_ALL );

    /* Enable the DMA transfer for the receiver request by setting the DMAR bit 
    in the UART CR3 register */
    huart->Instance->CR3 |= USART_CR3_DMAR;
    
	// Сбросить накопившиесЯ флаги прерываний
	//	__HAL_UART_CLEAR_FLAG( huart, UART_IT_RXNE );		// Сброс RXNE. Отработано на серии F4 в МПИ. Опечатка, работало по чистому совпадению
	//	__HAL_UART_CLEAR_FLAG( huart, UART_FLAG_RXNE ); 	// Сброс RXNE. Допустимо длЯ серии F4
	READ_REG( UART_INSTANCE_RDR( huart->Instance ) );		// Сброс RXNE. Правильно длЯ сери1 F4 и L4
	__HAL_UART_CLEAR_OREFLAG( huart );						// Сброс ORE. Правильно длЯ сери1 F4 и L4
	__HAL_UART_CLEAR_IDLEFLAG( huart ); 					// Сброс IDLE. Правильно длЯ сери1 F4 и L4
    // Разрешить прерывание USART.RxIdle
    __HAL_UART_ENABLE_IT( huart, UART_IT_IDLE );
    EXIT_CRITICAL_SECTION( );

    // Что делать с ошибками на шине - разрешать прерывания? 

    /* Process Unlocked */
    __HAL_UNLOCK(huart);
    
    return HAL_OK;
  }
  else
  {
    return HAL_BUSY; 
  }
}

// Закончить прием из UART по DMA в циклический буфер
HAL_StatusTypeDef HAL_UART_Ext_ReceiveCyclicStop( UART_Ext_HandleTypeDef *huart_ext )
{
	UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;

    __HAL_LOCK( huart );	// Заблокировать процесс

	if( huart->RxState & HAL_UART_STATE_BUSY_RX )
	{
		__HAL_UART_DISABLE_IT( huart, UART_IT_IDLE );		// Запретить прерывание USART.RxIdle
		HAL_UART_DMAStop( huart );							// Остановить прием из UART по DMA

		huart_ext->IRQ_Handlers.xRxIdle =  NULL;

		// Переинициализировать DMA в обычный режим (на случай внезапного запуска приема через стандартный API)
		huart->hdmarx->Init.Mode = DMA_NORMAL;
		assert_param( HAL_OK == HAL_DMA_Init( huart->hdmarx ) );

		// Выйти из режима приема
		huart->RxState = HAL_UART_STATE_READY;

		huart_ext->pByteQueueRx = NULL;
	}

	__HAL_UNLOCK(huart);	// Разблокировать процесс

	return HAL_OK;
}

// Очистить приемный буфер
HAL_StatusTypeDef HAL_UART_Ext_ReceiveCyclicReset( UART_Ext_HandleTypeDef *huart_ext )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;
	HAL_StatusTypeDef Result = HAL_ERROR;
	do
	{
		if( 0 == ( huart->RxState & HAL_UART_STATE_BUSY_RX ) )
			break;
		ENTER_CRITICAL_SECTION( );
		// Сбросить флаги ошибок UART
	    __HAL_UART_CLEAR_OREFLAG( huart );
		__HAL_UART_CLEAR_IDLEFLAG( huart );
		// Синхронизировать приемный буфер со счетчиком DMA
		UART_Ext_RxDMABuffer_Update( huart_ext );
		// Очистить приемный буфер
		ByteQueue_AdvanceTailTo( huart_ext->pByteQueueRx, huart_ext->pByteQueueRx->iHead );
		EXIT_CRITICAL_SECTION( );
#ifdef	USE_FREERTOS
		// Сбросить накопившиеся события
		xEventGroupClearBits( huart_ext->EventGroup, EVENT_UART_EXT_RX_ALL );
#endif	// USE_FREERTOS
		Result = HAL_OK;
	}
	while( 0 );
	return Result;
}

// Запустить прием из UART по DMA в буфер фиксированного размера (до заполнения буфера или Idle). Как контролировать количество принятых байт?
HAL_StatusTypeDef HAL_UART_Ext_ReceiveStart( UART_Ext_HandleTypeDef *huart_ext, uint8_t *pData, uint16_t Size, EventBits_t EventBitsMask )
{
  uint32_t *tmp;
  assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
  UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;
  assert_param( NULL != pData );
  
  if( huart->RxState == HAL_UART_STATE_READY )
  {
	  // Проверка, что приемник UART включен.
	  // ПредполагаетсЯ, что приемник включаетсЯ при инициализации, а не при запуске приема
	  if( 0 == ( huart_ext->Instance->CR1 & USART_CR1_RE ) )
	  {
		return HAL_ERROR;
	  }

    /* Process Locked */
    __HAL_LOCK(huart);
    
    huart->pRxBuffPtr = pData;
    huart->RxXferSize = Size;
    huart_ext->pByteQueueRx = NULL;

    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->RxState = HAL_UART_STATE_BUSY_RX;
    
	huart_ext->IRQ_Handlers.xRxIdle = UART_Ext_Receive_Idle_IT;

	// Переинициализировать DMA в обычный режим
	huart->hdmarx->Init.Mode = DMA_NORMAL;
	assert_param( HAL_OK == HAL_DMA_Init( huart->hdmarx ) );

    /* Set the UART DMA transfer complete callback */
//    huart->hdmarx->XferCpltCallback = UART_DMAReceiveCplt;
    huart->hdmarx->XferCpltCallback = UART_Ext_DMAReceiveCplt;		// Выставить событие по завершению приема и завершить прием
    
    /* Set the UART DMA Half transfer complete callback */
//    huart->hdmarx->XferHalfCpltCallback = UART_DMARxHalfCplt;
//	huart->hdmarx->XferHalfCpltCallback = UART_Ext_DMAReceiveCyclicCplt;	// Обновить счетчик принятых байт
	huart->hdmarx->XferHalfCpltCallback = NULL;
    
    /* Set the DMA error callback */
    huart->hdmarx->XferErrorCallback = UART_Ext_DMAError;

	// Инициализировать счетчик принятых байт
    huart->RxXferCount = 0;
    
#ifdef	USE_FREERTOS
	// Сбросить накопившиеся события
	xEventGroupClearBits( huart_ext->EventGroup, EVENT_UART_EXT_RX_ALL );
#endif	// USE_FREERTOS

    /* Enable the DMA Stream */
    tmp = (uint32_t*)&huart->pRxBuffPtr;
    assert_param( HAL_OK == HAL_DMA_Start_IT(huart->hdmarx, ( uint32_t ) &UART_INSTANCE_RDR( huart->Instance ), *(uint32_t*)tmp, huart->RxXferSize ) );

	ENTER_CRITICAL_SECTION( );
	// Запомнить маску событий по приему, которые надо будет сформировать
	WRITE_BIT_MASKED( huart_ext->EventBitsMask, EventBitsMask, EVENT_UART_EXT_RX_ALL );

    /* Clear the Overrun flag just before enabling the DMA Rx request: mandatory for the second transfer
       when using the USART in circular mode */
    __HAL_UART_CLEAR_OREFLAG( huart );

    /* Enable the DMA transfer for the receiver request by setting the DMAR bit 
    in the UART CR3 register */
    huart->Instance->CR3 |= USART_CR3_DMAR;
    
    // Разрешить прерывание USART.RxIdle
	__HAL_UART_CLEAR_IDLEFLAG( huart );
    __HAL_UART_ENABLE_IT( huart, UART_IT_IDLE );
	EXIT_CRITICAL_SECTION( );

    // Что делать с ошибками на шине - разрешать прерывания? 

    /* Process Unlocked */
    __HAL_UNLOCK(huart);
    
    return HAL_OK;
  }
  else
  {
    return HAL_BUSY; 
  }
}

/*HAL_StatusTypeDef HAL_UART_Ext_Receive( UART_Ext_HandleTypeDef *huart_ext, uint8_t *pData, uint16_t Size, EventBits_t EventBitsMask )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	huart_ext->EventBitsResult = 0;
	BootEvents = 0;
	EventBits_t BootEventsNew;
	HAL_UART_Ext_ReceiveStart( huart_ext, pData, Size, EVENT_UART_EXT_RX_ALL );
	do
	{
		ATOMIC_WRITE( BootEventsNew, BootEvents );
		extern void WatchdogReset( void );
		WatchdogReset( );
	}
	while( 0 == ( BootEventsNew & EVENT_UART_EXT_RX_ALL ) );

	{
		if( EVENT_UART_EXT_RX_IDLE != BootEventsNew )
			break;
	}
}
*/

// Закончить прием из UART по DMA в буфер
HAL_StatusTypeDef HAL_UART_Ext_ReceiveStop( UART_Ext_HandleTypeDef *huart_ext )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;

    __HAL_LOCK( huart );	// Заблокировать процесс

