DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
	if( huart->RxState == HAL_UART_STATE_BUSY_RX )
	{
		__HAL_UART_DISABLE_IT( huart, UART_IT_IDLE );		// Запретить прерывание USART.RxIdle
		HAL_UART_DMAStop( huart );							// Остановить прием из UART по DMA

		// Переинициализировать DMA в обычный режим (на случай внезапного запуска приема через стандартный API)
//		huart->hdmarx->Init.Mode = DMA_NORMAL;
//		assert_param( HAL_OK == HAL_DMA_Init( huart->hdmarx ) );

		huart_ext->IRQ_Handlers.xRxIdle = NULL;

		// Выйти из режима приема
		huart->RxState = HAL_UART_STATE_READY;
	}

	__HAL_UNLOCK(huart);	// Разблокировать процесс

	return HAL_OK;
}


// Обработчик прерывания UART для расширенного драйвера.
// Копия стандартного, но добавлены коллбеки UART.TxC и UART.Idle
void HAL_UART_Ext_IRQHandler(UART_HandleTypeDef *huart)
{
	UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * ) huart;
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );

  uint32_t tmp1 = 0, tmp2 = 0;

  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_PE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_PE);  
  /* UART parity error interrupt occurred ------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  { 
    __HAL_UART_CLEAR_PEFLAG(huart);
    
    huart->ErrorCode |= HAL_UART_ERROR_PE;
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_FE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_ERR);
  /* UART frame error interrupt occurred -------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  { 
    __HAL_UART_CLEAR_FEFLAG(huart);
    
    huart->ErrorCode |= HAL_UART_ERROR_FE;
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_NE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_ERR);
  /* UART noise error interrupt occurred -------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  { 
    __HAL_UART_CLEAR_NEFLAG(huart);
    
    huart->ErrorCode |= HAL_UART_ERROR_NE;
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_ORE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_ERR);
  /* UART Over-Run interrupt occurred ----------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  { 
    __HAL_UART_CLEAR_OREFLAG(huart);
    
    huart->ErrorCode |= HAL_UART_ERROR_ORE;
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_RXNE);
  /* UART in mode Receiver ---------------------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  { 
//    UART_Receive_IT(huart);
//	if( NULL != huart_ext->IRQ_Handlers.xRxComplete )
	assert_param( NULL != huart_ext->IRQ_Handlers.xRxComplete );
		huart_ext->IRQ_Handlers.xRxComplete( huart );
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_TXE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_TXE);
  /* UART in mode Transmitter ------------------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
//    UART_Transmit_IT(huart);
//	if( NULL != huart_ext->IRQ_Handlers.xTxEmpty )
	assert_param( NULL != huart_ext->IRQ_Handlers.xTxEmpty );
		huart_ext->IRQ_Handlers.xTxEmpty( huart );
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_TC);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_TC);
  /* UART Transmitte Complete ------------------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
	if( NULL != huart_ext->IRQ_Handlers.xTxComplete )
//	assert_param( NULL != huart_ext->IRQ_Handlers.xTxComplete );
		huart_ext->IRQ_Handlers.xTxComplete( huart );
	else
		__HAL_UART_DISABLE_IT( huart, UART_IT_TC );

//    UART_Ext_Transmit_Complete_IT(huart);
  }
  
  tmp1 = __HAL_UART_GET_FLAG(huart, UART_FLAG_IDLE);
  tmp2 = __HAL_UART_GET_IT_SOURCE(huart, UART_IT_IDLE);
  /* UART Receive Idle ------------------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
	__HAL_UART_CLEAR_IDLEFLAG(huart);
//    UART_Ext_Receive_Idle_IT(huart);
//	if( NULL != huart_ext->IRQ_Handlers.xRxIdle )
	assert_param( NULL != huart_ext->IRQ_Handlers.xRxIdle );
		huart_ext->IRQ_Handlers.xRxIdle( huart );
  }
  
  if(huart->ErrorCode != HAL_UART_ERROR_NONE)
  {
    /* Set the UART state ready to be able to start again the process */
    huart->gState = HAL_UART_STATE_READY;
    huart->RxState = HAL_UART_STATE_READY;
    
    HAL_UART_ErrorCallback(huart);
  }  
}

/**
  * @brief  DMA UART transmit process complete callback. 
  * @param  hdma: DMA handle
  * @retval None
  */
static void UART_Ext_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
// !Важно! Приоритет прерываний от UART не должен быть выше, чем от DMA - иначе UART.TxC может отработаться раньше, чем DMA.TxC!!
  
  UART_HandleTypeDef* huart = ( UART_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * ) huart;
  assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
  
  /* DMA Normal mode*/
#if		defined( STM32F4 )
  if((hdma->Instance->CR & DMA_SxCR_CIRC) == 0)
#elif	defined( STM32L4 ) || defined( STM32F3 )
  if((hdma->Instance->CCR & DMA_CCR_CIRC) == 0)
#else
#error "Select Target Family!"
#endif	// STM32XX
  {
    huart->TxXferCount = 0;

    /* Disable the DMA transfer for transmit request by setting the DMAT bit
       in the UART CR3 register */
    huart->Instance->CR3 &= (uint32_t)~((uint32_t)USART_CR3_DMAT);

	// В отличии от стандартного обработчика, не ждать появление флага UART.TxC
	
	// Не смотря на то, что последний байт еще передается, UART уже готов к принятию нового буфера
	huart->gState = HAL_UART_STATE_READY;

	// Генерировать событие по завершению передачи буфера DMA в UART
	if( huart_ext->EventBitsMask & EVENT_UART_EXT_TX_DMA_COMPLETE )
	{
		huart_ext->EventBitsMask &= ~EVENT_UART_EXT_TX_DMA_COMPLETE;
#ifdef	USE_FREERTOS
		BaseType_t xHigherPriorityTaskWoken = pdFALSE;
		assert_param( pdPASS == xEventGroupSetBitsFromISR( huart_ext->EventGroup, EVENT_UART_EXT_TX_DMA_COMPLETE, &xHigherPriorityTaskWoken ) );
		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif	//USE_FREERTOS
	}
  }
  /* DMA Circular mode */
  else
  {
    HAL_UART_TxCpltCallback(huart);
  }

