DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
}

/**
  * @brief  DMA UART communication error callback.
  * @param  hdma: DMA handle
  * @retval None
  */
// Обычный обработчик, с добавлением генерации события при ошибке
// Добавлено разделение в зависимости от канала DMA (RX либо TX) 
static void UART_Ext_DMAError( DMA_HandleTypeDef *hdma )   
{
  UART_HandleTypeDef* huart = ( UART_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * ) huart;
  assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );

  // Генерировать событие по ошибке, в зависимости от канала DMA (RX либо TX)
  EventBits_t EventBits = 0;
  if( hdma == huart->hdmatx )
  {
  	EventBits = EVENT_UART_EXT_TX_ERROR;
	huart->TxXferCount = 0;
//	huart->gState = HAL_UART_STATE_READY;
    UART_Ext_EndTxTransfer(huart);
  }
  else if( hdma == huart->hdmarx )
  {
  	EventBits = EVENT_UART_EXT_RX_ERROR;
	huart->RxXferCount = 0;
//	huart->RxState = HAL_UART_STATE_READY;
    UART_Ext_EndRxTransfer(huart);
  }
  else
  	assert_param( 0 );
  huart->ErrorCode |= HAL_UART_ERROR_DMA;		// Одна ошибка, и на RX, и на TX - могут быть проблемы!
  	
  EventBits &= huart_ext->EventBitsMask;
  if( EventBits )
  {
	huart_ext->EventBitsMask &= ~EventBits;
#ifdef	USE_FREERTOS
	BaseType_t xHigherPriorityTaskWoken = pdFALSE;
	assert_param( pdPASS == xEventGroupSetBitsFromISR( huart_ext->EventGroup, EventBits, &xHigherPriorityTaskWoken ) );
	portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif	// USE_FREERTOS
  }

  HAL_UART_ErrorCallback(huart);
}

/**
  * @brief  UART transmit process complete callback. 
  * @param  huart: pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
// Генерировать событие по USART.TxC и опционально запрещать передачу драйвером RS-485
static void UART_Ext_Transmit_Complete_IT( UART_HandleTypeDef *huart )
{
	UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * ) huart;
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );

	// Запретить прерывание USART.TxC. Новое разрешение, с очисткой флага, выдается в HAL_UART_Ext_Transmit()
#if		defined( STM32F4 )
	  __HAL_UART_DISABLE_IT( huart, UART_IT_TC );
	  __HAL_UART_CLEAR_FLAG( huart, UART_FLAG_TC );
#elif	defined( STM32L4 ) || defined( STM32F3 )
	  __HAL_UART_DISABLE_IT( huart, UART_IT_TC );
	  __HAL_UART_CLEAR_FLAG( huart, UART_CLEAR_TCF );
#else
#error "Select Target Family!"
#endif	// STM32XX

    huart_ext->IRQ_Handlers.xTxComplete = NULL;

	// Восстановить прием, если ранее был разрешен
	HAL_UART_Ext_RxForModemRestore( ( UART_Ext_HandleTypeDef * ) huart );

	/* Check if a receive process is ongoing or not */
	// Подразумевается, что операция huart->State = HAL_UART_STATE_READY уже выполнена в UART_Ext_DMATransmitCplt( )

	// Запретить передачу RS-485
	if( huart_ext->TXEN_GPIO != NULL )
	{
		HAL_GPIO_WritePin( huart_ext->TXEN_GPIO, huart_ext->TXEN_Pin, GPIO_PIN_RESET );
	}

	// Генерировать событие по завершению передачи через UART
	if( huart_ext->EventBitsMask & EVENT_UART_EXT_TX_COMPLETE )
	{
		huart_ext->EventBitsMask &= ~EVENT_UART_EXT_TX_COMPLETE;
#ifdef	USE_FREERTOS
		BaseType_t xHigherPriorityTaskWoken = pdFALSE;
		assert_param( pdPASS == xEventGroupSetBitsFromISR( huart_ext->EventGroup, EVENT_UART_EXT_TX_COMPLETE, &xHigherPriorityTaskWoken ) );
		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif	// USE_FREERTOS
	}

	// Вызов опционального (__weak) коллбека.
	// Подразумевается, что драйвер обеспечивает управление RS485.TxEn и генерацию события RTOS, и коллбек не нужен.
	HAL_UART_TxCpltCallback( huart );
	UART_Ext_Callback_t TxCompleteCallback = huart_ext->TxCompleteCallback;
	if( NULL != TxCompleteCallback )
		TxCompleteCallback( );
	
	/* At end of Tx process, restore huart->gState to Ready */
	huart->gState = HAL_UART_STATE_READY;
}

// Обработчик прерывниЯ UART.TxEmpty (длЯ режима работы без DMA).
// Пока есть данные в буфере - передавать.
// Как закончились данные - разрешить прерывание UART.TxComplete
static void UART_Ext_Transmit_Empty8_IT( UART_HandleTypeDef *huart )			// [замена]	UART_TxISR_8BIT
{
	// Check that a Tx process is ongoing
	if( huart->gState == HAL_UART_STATE_BUSY_TX )
	{
		if( huart->TxXferCount == 0 )
		{
			// Disable the UART Transmit Data Register Empty Interrupt
#ifdef	USART_CR1_FIFOEN
#error
#endif
#if		defined( STM32F4 )
			__HAL_UART_DISABLE_IT( huart, UART_IT_TXE );
			__HAL_UART_CLEAR_FLAG( huart, UART_FLAG_TC );
#elif	defined( STM32L4 ) || defined( STM32F3 )
			__HAL_UART_DISABLE_IT( huart, UART_IT_TXE );
			__HAL_UART_CLEAR_FLAG( huart, UART_CLEAR_TCF );
#else
#error "Select Target Family!"
#endif	// STM32XX
		  ( ( UART_Ext_HandleTypeDef * ) huart )->IRQ_Handlers.xTxEmpty = NULL;

		  // Enable the UART Transmit Complete Interrupt
		  ( ( UART_Ext_HandleTypeDef * ) huart )->IRQ_Handlers.xTxComplete = UART_Ext_Transmit_Complete_IT;
			__HAL_UART_ENABLE_IT( huart, UART_IT_TC );
		}
		else
		{
			UART_INSTANCE_TDR( huart->Instance ) = ( uint8_t ) ( *huart->pTxBuffPtr++ & ( uint8_t ) 0xFF );
			huart->TxXferCount--;
		}
	  }
}


// Генерировать событие по USART.RxIdle
static void UART_Ext_Receive_Idle_IT( UART_HandleTypeDef *huart )
{
	UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * ) huart;
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );

	// Обновить счетчик принятых байт
	if( NULL != huart_ext->pByteQueueRx )
		UART_Ext_RxDMABuffer_Update( huart_ext );
	else
	{
		uint32_t DMA_RxCntRemain = __HAL_DMA_GET_COUNTER( huart_ext->Common.hdmarx );
		huart_ext->Common.RxXferCount = huart_ext->Common.RxXferSize - DMA_RxCntRemain;
	}

	// Генерировать событие по USART.RxIdle
	if( huart_ext->EventBitsMask & EVENT_UART_EXT_RX_IDLE )
	{
		// Не сбрасывать EVENT_UART_EXT_RX_IDLE в EventBitsMask - это событие можно генерить многократно (пока?)
#ifdef	USE_FREERTOS
		BaseType_t xHigherPriorityTaskWoken = pdFALSE;
		assert_param( pdPASS == xEventGroupSetBitsFromISR( huart_ext->EventGroup, EVENT_UART_EXT_RX_IDLE, &xHigherPriorityTaskWoken ) );
		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif	// USE_FREERTOS
	}

	// Вызов опционального (__weak) коллбека.
	// (которого в стандартном драйвере не предусмотрено)
	HAL_UART_RxIdleCallback( huart );
}

/**
  * @brief  Receive Idle callbacks.
  * @param  huart: pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
__weak void HAL_UART_RxIdleCallback( UART_HandleTypeDef *huart )
{
  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_UART_RxIdleCallback could be implemented in the user file
   */ 
}

// Переместить голову приемного буфера по состоянию канала DMA (вызывать только из прерываний!!)
// Вызов производится из обработчиков UART.RxIdle, UART.RxDMA.RxC, UART.RxDMA.RxHalf
static void UART_Ext_RxDMABuffer_Update( UART_Ext_HandleTypeDef *huart_ext )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	assert_param( NULL != huart_ext->pByteQueueRx ); 
	// Получить новый индекс головы
	ByteQueueIndex_t iHeadNew = huart_ext->pByteQueueRx->Size - __HAL_DMA_GET_COUNTER( huart_ext->Common.hdmarx );

	// Обновить счетчик и положение головы (переполнение не контролируется!)
	ByteQueueIndex_t Increment = ByteQueue_AdvanceHeadTo( huart_ext->pByteQueueRx, iHeadNew );
	huart_ext->Common.RxXferCount += Increment;
}

// Обработчик UART.Rx.DMA.Complete и UART.Rx.DMA.HalfComplete - перемещает голову очереди вперед. Может понадобиться при приеме больших непрерывных пакетов
static void UART_Ext_DMAReceiveCyclicCplt( DMA_HandleTypeDef *hdma )
{
	UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * )( ( DMA_HandleTypeDef *) hdma )->Parent;
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );

	// Обновить счетчик принятых байт
	UART_Ext_RxDMABuffer_Update( huart_ext );
}

// Обработчик UART.Rx.DMA.Complete - выставляет флаг завершения према запрошенного буфера
static void UART_Ext_DMAReceiveCplt( DMA_HandleTypeDef *hdma )
{
	UART_Ext_HandleTypeDef* huart_ext = ( UART_Ext_HandleTypeDef * )( ( DMA_HandleTypeDef *) hdma )->Parent;
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );

