DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
	// Генерировать событие по DMA.RxComplete
	if( huart_ext->EventBitsMask & EVENT_UART_EXT_RX_COMPLETE )
	{
#ifdef	USE_FREERTOS
		BaseType_t xHigherPriorityTaskWoken = pdFALSE;
		assert_param( pdPASS == xEventGroupSetBitsFromISR( huart_ext->EventGroup, EVENT_UART_EXT_RX_COMPLETE, &xHigherPriorityTaskWoken ) );
		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif	// USE_FREERTOS
		HAL_UART_RxCpltCallback( &huart_ext->Common );
	}
	else
		assert_param( 0 );
}

// Проверка активности при приеме в циклический буфер по DMA - сравнение текущего DMA.NDTR и предыдущего, сохраненного в *pPrevState
bool UART_Ext_RxDMA_CheckActivity( UART_Ext_HandleTypeDef *huart_ext, uint32_t *pPrevState )
{
	assert_param( ( NULL != huart_ext ) && ( NULL != pPrevState ) );

	uint32_t PrevState = *pPrevState;
	*pPrevState = __HAL_DMA_GET_COUNTER( huart_ext->Common.hdmarx );

	return *pPrevState != PrevState;
}

// Изменить скорость UART
#if		defined( STM32F4 )
// Изменить скорость UART без прочей переинициализации.
// Фрагмент из закрытой функции UART_SetConfig( ) драйвера HAL_UART длЯ STM32F4
void HAL_UART_Ext_ResetBaudrate( UART_HandleTypeDef *huart )
{
	/* Check the parameters */
	assert_param( NULL != huart );
	assert_param(IS_UART_INSTANCE(huart->Instance));
	assert_param(IS_UART_BAUDRATE(huart->Init.BaudRate));  

	/* Check the Over Sampling */
	if(huart->Init.OverSampling == UART_OVERSAMPLING_8)
	{
	  /*-------------------------- USART BRR Configuration ---------------------*/
	  if((huart->Instance == USART1) || (huart->Instance == USART6))
	  {
		huart->Instance->BRR = UART_BRR_SAMPLING8(HAL_RCC_GetPCLK2Freq(), huart->Init.BaudRate);
	  }
	  else
	  {
		huart->Instance->BRR = UART_BRR_SAMPLING8(HAL_RCC_GetPCLK1Freq(), huart->Init.BaudRate);
	  }
	}
	else
	{
	  /*-------------------------- USART BRR Configuration ---------------------*/
	  if((huart->Instance == USART1) || (huart->Instance == USART6))
	  {
		huart->Instance->BRR = UART_BRR_SAMPLING16(HAL_RCC_GetPCLK2Freq(), huart->Init.BaudRate);
	  }
	  else
	  {
		huart->Instance->BRR = UART_BRR_SAMPLING16(HAL_RCC_GetPCLK1Freq(), huart->Init.BaudRate);
	  }
	}
}
#elif		defined( STM32L4 ) || defined( STM32F3 )
// Изменить скорость UART вместе с прочей переинициализацией
// ФункциЯ UART_SetConfig( ) в драйвере HAL_UART длЯ STM32L4 открыта.
void HAL_UART_Ext_ResetBaudrate( UART_HandleTypeDef *huart )
{
	UART_SetConfig( huart );
}
#else
#error "Select Target Family!"
#endif

// [байт/с]	Рассчитать байтовую скорость интерфейса
uint32_t HAL_UART_Ext_CalcByteRate( UART_Ext_HandleTypeDef *huart_ext )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	UART_InitTypeDef *pInit = &huart_ext->Common.Init;
/*	assert_param( IS_UART_WORD_LENGTH	( pInit->WordLength ) );  
	assert_param( IS_UART_BAUDRATE		( pInit->BaudRate ) );  
	assert_param( IS_UART_STOPBITS		( pInit->StopBits ) );
	assert_param( IS_UART_PARITY		( pInit->Parity ) );
*/
	uint32_t Result = 0;
	do
	{
		uint8_t BitsInByte = 1;		// Start Bit

		if( UART_WORDLENGTH_8B == pInit->WordLength )
			BitsInByte += 8;
		else if( UART_WORDLENGTH_9B == pInit->WordLength )
			BitsInByte += 9;
		else
			break;
		
		if( UART_STOPBITS_1 == pInit->StopBits )
			BitsInByte += 1;
		else if( UART_STOPBITS_2 == pInit->StopBits )
			BitsInByte += 2;
		else
			break;
		
		if( UART_PARITY_NONE == pInit->Parity )
			;
		else if( ( UART_PARITY_EVEN == pInit->Parity ) || ( UART_PARITY_ODD == pInit->Parity ) )
			BitsInByte += 1;
		else
			break;
		
		Result = pInit->BaudRate / BitsInByte;
	} while( 0 );
	return Result;
}

// [с]	Рассчитать времЯ на передачу пакета
float HAL_UART_Ext_CalcTimeToTransmite( UART_Ext_HandleTypeDef *huart_ext, uint16_t PacketSize )
{
	float ResultTime = -1.0f;
	do
	{
		if( 0 == PacketSize )
			break;
		uint32_t ByteRate = HAL_UART_Ext_CalcByteRate( huart_ext );
		if( 0 == ByteRate )
			break;
		ResultTime = PacketSize / ( float ) ByteRate;
	}
	while( 0 );
	return ResultTime;
}

// Запуск UART на прием без каких-либо обработок.
// Обработчики прерываний реализованы в приложении.
HAL_StatusTypeDef HAL_UART_Ext_ReceiveRawStart( UART_Ext_HandleTypeDef *huart_ext, UART_Ext_IT_t xRxIT, UART_Ext_IT_t xRxIdleIT )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;
	
	if( huart->RxState == HAL_UART_STATE_READY )
	{
		// Проверка, что приемник UART включен.
		// ПредполагаетсЯ, что приемник включаетсЯ при инициализации, а не при запуске приема
		if( 0 == ( huart_ext->Instance->CR1 & USART_CR1_RE ) )
		{
		  return HAL_ERROR;
		}

	  /* Process Locked */
	  __HAL_LOCK(huart);
	  
	  huart->pRxBuffPtr = NULL;
	  huart->RxXferSize = 0;
	  huart->RxXferCount = 0;
	  
	  huart->ErrorCode = HAL_UART_ERROR_NONE;
	  huart->RxState = HAL_UART_STATE_BUSY_RX;

	  /* Enable the UART Parity Error Interrupt */
//	  __HAL_UART_ENABLE_IT(huart, UART_IT_PE);
	  
	  /* Enable the UART Error Interrupt: (Frame error, noise error, overrun error) */
//	  __HAL_UART_ENABLE_IT(huart, UART_IT_ERR);
	  
		ENTER_CRITICAL_SECTION( );

	  // Разрешить прерывание USART.RxC
	  if( NULL != xRxIT )
		  __HAL_UART_ENABLE_IT( huart, UART_IT_RXNE );
	  else
		  __HAL_UART_DISABLE_IT( huart, UART_IT_RXNE );
	  huart_ext->IRQ_Handlers.xRxComplete = xRxIT;
	  
	  // Разрешить прерывание USART.RxIdle
	  if( NULL != xRxIdleIT )
		  __HAL_UART_ENABLE_IT( huart, UART_IT_IDLE );
	  else
		  __HAL_UART_DISABLE_IT( huart, UART_IT_IDLE );
	  huart_ext->IRQ_Handlers.xRxIdle = xRxIdleIT;

		// Сбросить накопившиесЯ флаги прерываний
		//	__HAL_UART_CLEAR_FLAG( huart, UART_IT_RXNE );		// Сброс RXNE. Отработано на серии F4 в МПИ. Опечатка, работало по чистому совпадению
		//	__HAL_UART_CLEAR_FLAG( huart, UART_FLAG_RXNE );		// Сброс RXNE. Допустимо длЯ серии F4
		READ_REG( UART_INSTANCE_RDR( huart->Instance ) );		// Сброс RXNE. Правильно длЯ сери1 F4 и L4
		__HAL_UART_CLEAR_OREFLAG( huart );						// Сброс ORE. Правильно длЯ сери1 F4 и L4
		__HAL_UART_CLEAR_IDLEFLAG( huart );						// Сброс IDLE. Правильно длЯ сери1 F4 и L4

	  EXIT_CRITICAL_SECTION( );
	  
	  /* Process Unlocked */
	  __HAL_UNLOCK(huart);
	  
	  return HAL_OK;
	}
	else
	{
	  return HAL_BUSY; 
	}
}

// Закончить прием из UART, начатый в HAL_UART_Ext_ReceiveRawStart()
HAL_StatusTypeDef HAL_UART_Ext_ReceiveRawStop( UART_Ext_HandleTypeDef *huart_ext )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	UART_HandleTypeDef *huart = ( UART_HandleTypeDef * ) huart_ext;

    __HAL_LOCK( huart );	// Заблокировать процесс

