DmitriyKunitsin/STM32/Manchester_Slave/Firmware/Source/Library/Platforms/Common/Stm32xxxx_hal_uart_ext.c
	if( huart->RxState == HAL_UART_STATE_BUSY_RX )
	{
		__HAL_UART_DISABLE_IT( huart, UART_IT_IDLE );		// Запретить прерывание USART.RxIdle
		__HAL_UART_DISABLE_IT( huart, UART_IT_RXNE );		// Запретить прерывание USART.RxRxNE

		huart_ext->IRQ_Handlers.xRxIdle = NULL;
		huart_ext->IRQ_Handlers.xRxComplete = NULL;

		// Выйти из режима приема
		huart->RxState = HAL_UART_STATE_READY;
	}

	__HAL_UNLOCK(huart);	// Разблокировать процесс

	return HAL_OK;
}

// Установить коллбек при завершении передачи пакета через UART
// Вернуть ранее заданный коллбек
UART_Ext_Callback_t UART_Ext_SetTransferCompleteCallback( UART_Ext_HandleTypeDef *huart_ext, UART_Ext_Callback_t xCallback )
{
	assert_param( HAL_UART_Ext_ValidateHdl( huart_ext ) );
	UART_Ext_Callback_t xPevCallback;
	ENTER_CRITICAL_SECTION( );
	xPevCallback = huart_ext->TxCompleteCallback;
	huart_ext->TxCompleteCallback = xCallback;
	EXIT_CRITICAL_SECTION( );
	return xPevCallback;
}


// Копирование UART_EndTxTransfer() и UART_EndRxTransfer() из стандартного драйвера

#if		defined (STM32L4)
/**
  * @brief  End ongoing Tx transfer on UART peripheral (following error detection or Transmit completion).
  * @param huart UART handle.
  * @retval None
  */
static void UART_Ext_EndTxTransfer(UART_HandleTypeDef *huart)
{
  /* Disable TXEIE and TCIE interrupts */
#if defined(USART_CR1_FIFOEN)
  CLEAR_BIT(huart->Instance->CR1, (USART_CR1_TXEIE_TXFNFIE | USART_CR1_TCIE));
#else
  CLEAR_BIT(huart->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));
#endif

  // Восстановить прием, если ранее был разрешен
  HAL_UART_Ext_RxForModemRestore( ( UART_Ext_HandleTypeDef * ) huart );

  /* At end of Tx process, restore huart->gState to Ready */
  huart->gState = HAL_UART_STATE_READY;
}


/**
  * @brief  End ongoing Rx transfer on UART peripheral (following error detection or Reception completion).
  * @param huart UART handle.
  * @retval None
  */
static void UART_Ext_EndRxTransfer(UART_HandleTypeDef *huart)
{
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
#if defined(USART_CR1_FIFOEN)
  CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));
#else
  CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
#endif
  CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

  /* At end of Rx process, restore huart->RxState to Ready */
  huart->RxState = HAL_UART_STATE_READY;
  
  /* Reset RxIsr function pointer */
  huart->RxISR = NULL;
}

#elif	defined (STM32F4)
/**
  * @brief  End ongoing Tx transfer on UART peripheral (following error detection or Transmit completion).
  * @param  huart: UART handle.
  * @retval None
  */
static void UART_Ext_EndTxTransfer(UART_HandleTypeDef *huart)
{
  /* Disable TXEIE and TCIE interrupts */
  CLEAR_BIT(huart->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));

  // Восстановить прием, если ранее был разрешен
  HAL_UART_Ext_RxForModemRestore( ( UART_Ext_HandleTypeDef * ) huart );

  /* At end of Tx process, restore huart->gState to Ready */
  huart->gState = HAL_UART_STATE_READY;
}

/**
  * @brief  End ongoing Rx transfer on UART peripheral (following error detection or Reception completion).
  * @param  huart: UART handle.
  * @retval None
  */
static void UART_Ext_EndRxTransfer(UART_HandleTypeDef *huart)
{
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
  CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

  /* At end of Rx process, restore huart->RxState to Ready */
  huart->RxState = HAL_UART_STATE_READY;
}

#else
#error "Select Target Family!"
#endif	// STM32XXX
